RIET/src/Catalogs/РКХ_ФункциональныеОпцииРабочихБаз/РКХ_ФункциональныеОпцииРабочихБаз.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>РКХ_ФункциональныеОпцииРабочихБаз</name>
  <predefined>
    <items>
      <name>ЭтаКонфигурация</name>
      <description>Эта конфигурация</description>
    </items>
  </predefined>
  <attributes>
    <name>СправочникКонтрагентыКипр</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокументTicketsКипр</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокументРеализацияТоваровУслугКипр</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокументРеализацияТоваровУслугSLI</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокументСчетНаОплатуПокупателюКипр</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокументСчетНаОплатуПокупателюSLI</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокументSiebelOrdersКипр</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:Catalog>

RIET/src/Catalogs/РКХ_ФункциональныеОпцииРабочихБаз/Forms/ФормаЭлемента/Module.bsl
&НаКлиенте
Процедура УстановитьПоУмолчанию(Команда)
	
	ИдентификаторРабочейБазы = Константы.FiscalParentCompany.Получить();
	
	Если НЕ ИдентификаторРабочейБазы = Справочники.SoldTo.НайтиПоКоду("SLI RU") И НЕ ИдентификаторРабочейБазы = Справочники.SoldTo.НайтиПоКоду("PA") Тогда
		Сообщить("Идентификатор рабочей базы неизвестен, обратитесь к администратору для установки верного идентификатора");
		Возврат;	
	КонецЕсли;		
	
	Если  ИдентификаторРабочейБазы = Справочники.SoldTo.НайтиПоКоду("PA") Тогда
		
		Объект.СправочникКонтрагентыКипр 			= Истина;	
		Объект.ДокументTicketsКипр 					= Истина;
		Объект.ДокументРеализацияТоваровУслугКипр	= Истина;
		Объект.ДокументСчетНаОплатуПокупателюКипр	= Истина;
		Объект.ДокументSiebelOrdersКипр				= Истина; 		
		
		Объект.ДокументРеализацияТоваровУслугSLI	= Ложь;
		Объект.ДокументСчетНаОплатуПокупателюSLI	= Ложь;
		
	Иначе
		
		Объект.ДокументРеализацияТоваровУслугSLI	= Истина;
		Объект.ДокументСчетНаОплатуПокупателюSLI	= Истина;
		
		Объект.СправочникКонтрагентыКипр 			= Ложь;
		Объект.ДокументTicketsКипр 					= Ложь;
		Объект.ДокументРеализацияТоваровУслугКипр	= Ложь;
		Объект.ДокументСчетНаОплатуПокупателюКипр	= Ложь;
		Объект.ДокументSiebelOrdersКипр				= Ложь;
		
	КонецЕсли;
	
КонецПроцедуры
